Revit 2027 API
PropertyLine.GetPropertyTable Method
 Gets the table entries for a table-based PropertyLine element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<PropertyTableEntry> GetPropertyTable()
Public Function GetPropertyTable As IList(Of PropertyTableEntry)
public:
IList<PropertyTableEntry^>^ GetPropertyTable()
member GetPropertyTable : unit -> IList<PropertyTableEntry>
Return Value
IList<PropertyTableEntry>
Exceptions
Exception | Condition
InvalidOperationException |  PropertyLine is not table-based. -or- Failed to get property table for the property line element if it is sketch-based.
See Also
Reference
PropertyLine Class
Autodesk.Revit.DB Namespace